; x86汇编语言：从实模式到保护模式

        flat_4gb_code_seg_sel   equ 0x0008      ; 平坦模型下的4GB代码段选择子 
        flat_4gb_data_seg_sel   equ 0x0018      ; 平坦模型下的4GB数据段选择子
        idt_linear_address      equ 0x8001f000  ; 中断描述符表的线性基地址
        
;---------------------------------------------------------------------




SECTION core    vstart=0x80040000
    
        ; 系统核心头部，用于加载核心程序
        core_length     dd core_end             ; 核心程序总长度   #00
        core_entry      dd start                ; 核心代码段入口点 #04


;---------------------------------------------------------------------
        [bits 32]
;---------------------------------------------------------------------
;
; 字符串显示（适用于平坦内存模型）
; @Param EBX=字符串的线性地址
; 
put_string:
        ; TODO
;---------------------------------------------------------------------
; 在当前光标处显示一个字符，并推进光标。仅用于段内调用
; @Param CL=字符ASCII码
put_char:
        ; TODO

;---------------------------------------------------------------------
;
; 从硬盘读取一个逻辑扇区（平坦模型）
; @Param EAX=逻辑扇区号
; @Param EBX=目标缓冲区线性地址
; @Return EBX=EBX+512
read_hard_disk_0:
        ; TODO

;---------------------------------------------------------------------
put_hax_dword:
        ; TODO

;---------------------------------------------------------------------
set_up_gdt_descriptor:
        ; TODO
    
;---------------------------------------------------------------------
make_seg_descriptor:
        ; TODO

;---------------------------------------------------------------------
make_gate_descriptor:
        ; TODO
;---------------------------------------------------------------------
allocate_a_4k_page:
        ; TODO
;---------------------------------------------------------------------
alloc_inst_a_page:
        ; TODO
;---------------------------------------------------------------------
create_copy_cur_pdir:
        ; TODO

;---------------------------------------------------------------------
general_interrupt_handler:
        ; TODO

;---------------------------------------------------------------------
general_exception_handler:
        ; TODO

;---------------------------------------------------------------------
rtm_0x70_interrupt_handle:
        ; TODO

;---------------------------------------------------------------------
terminate_current_task:
        ; TODO

;---------------------------------------------------------------------
        pgdt        dw  0               ; 用于设置和修改GDT
                    dd  0

        pidt        dw  0
                    dd  0
        
        ; 任务控制块链
        tcb_chain   dd  0

        core_tcb  times 32 db 0         ; 内核（程序管理器）的TCB
        ; TODO
;---------------------------------------------------------------------
fill_descriptor_in_ldt:
        ; TODO
;---------------------------------------------------------------------
load_relocate_program:
        ; TODO
;---------------------------------------------------------------------
append_to_tcb_link:
        ; TODO
;---------------------------------------------------------------------
start:
        ; TODO
core_code_end:

;---------------------------------------------------------------------
SECTION core_trail
;---------------------------------------------------------------------
core_end:
